In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
ratings = pd.read_csv('D:\\DataScience\\Term 2\\7.MLOPS\\MLOPS final assignment\\MLOPS_project\\ratings_small.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1       31     2.5  1260759144
1       1     1029     3.0  1260759179
2       1     1061     3.0  1260759182
3       1     1129     2.0  1260759185
4       1     1172     4.0  1260759205

In [3]:
movie_meta = pd.read_csv('D:\\DataScience\\Term 2\\7.MLOPS\\MLOPS final assignment\\MLOPS_project\\movies_metadata.csv')
movie_meta.head()

C:\Users\chall\AppData\Local\Temp\ipykernel_11044\1915645484.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  movie_meta = pd.read_csv('D:\\DataScience\\Term 2\\7.MLOPS\\MLOPS final assignment\\MLOPS_project\\movies_metadata.csv')

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0

In [4]:
movie_meta = movie_meta[['id','title']]
movie_meta.head()

      id                        title
0    862                    Toy Story
1   8844                      Jumanji
2  15602             Grumpier Old Men
3  31357            Waiting to Exhale
4  11862  Father of the Bride Part II

In [24]:
movie_meta['id'] = pd.to_numeric(movie_meta['id'],errors = 'coerce',downcast='integer')
movie_meta.dropna(axis=0,inplace=True)
movie_meta['id'] = movie_meta['id'].astype('int')
movie_meta

           id                        title
0         862                    Toy Story
1        8844                      Jumanji
2       15602             Grumpier Old Men
3       31357            Waiting to Exhale
4       11862  Father of the Bride Part II
...       ...                          ...
45461  439050                       Subdue
45462  111109          Century of Birthing
45463   67758                     Betrayal
45464  227506             Satan Triumphant
45465  461257                     Queerama

[45460 rows x 2 columns]

In [31]:
ratings_movie_title = pd.merge(left=ratings,right = movie_meta,how='left',left_on = 'movieId',right_on='id')
ratings_movie_title

        userId  movieId  rating   timestamp  id title
0            1       31     2.5  1260759144 NaN   NaN
1            1     1029     3.0  1260759179 NaN   NaN
2            1     1061     3.0  1260759182 NaN   NaN
3            1     1129     2.0  1260759185 NaN   NaN
4            1     1172     4.0  1260759205 NaN   NaN
...        ...      ...     ...         ...  ..   ...
100004     671     6268     2.5  1065579370 NaN   NaN
100005     671     6269     4.0  1065149201 NaN   NaN
100006     671     6365     4.0  1070940363 NaN   NaN
100007     671     6385     2.5  1070979663 NaN   NaN
100008     671     6565     3.5  1074784724 NaN   NaN

[100009 rows x 6 columns]

In [16]:
movie_meta['id'] = pd.to_numeric(movie_meta['id'],errors = 'coerce')
movie_meta.dtypes

id       float64
title     object
dtype: object

id       object
title    object
dtype: object

In [7]:
ratings.dtypes

userId         int64
movieId        int64
rating       float64
timestamp      int64
dtype: object